# 1.PySpark Connection part

In [83]:
#Connection part for Pyspark and importing required packages.
import pandas as pd
import numpy as np

from pyspark.sql import SparkSession
from pyspark.sql.types import *
from pyspark.sql.functions import *
from pyspark.sql import *

spark = SparkSession.builder.appName("Pyspark_VS_Pandas").getOrCreate()
conf = spark.sparkContext._conf.setAll([('spark.driver.memory', '4g'), ('spark.executor.memory', '4g'), ('spark.executor.num','6'), ('spark.network.timeout', '1000000')])

# 2.Reading data into Pyspark dataframe

In [64]:
#Creating Pyspark dataframe so that we apply SQL scripts for our practice
#    1.Read it into Pandas df
#    2.convert into pyspark df by defining datatypes of each columns
#    [we can use spark.read.format("") option, but it requires additional packages installation so skipped this way]

#####################################################################################################
#1.STUDENT
student_dfpd = pd.read_excel(r'Table_Source\Student_Placement_Table.xlsx')
schema_student = StructType([\
                     StructField("ID",IntegerType(),False),\
                     StructField("Name",StringType(),False),\
                     StructField("Gender",StringType(),False),\
                     StructField("DOB",DateType(),False),\
                     StructField("Location",StringType(),True),\
                     StructField("University",StringType(),False),\
                     StructField("Salary",DoubleType(),False),\
                     StructField("Company",StringType(),False),\
                     StructField("Email",StringType(),False)])

student_dfps = spark.createDataFrame(student_dfpd, schema_student)

#####################################################################################################
#2.UNIVERSITY
university_dfpd = pd.read_excel(r'Table_Source\University_Table.xlsx')
schema_university = StructType([\
                     StructField("University",StringType(),False),\
                     StructField("MinSalary",StringType(),False),\
                     StructField("PlayGround",StringType(),False),\
                     StructField("Total_Students",IntegerType(),False)])
university_dfps = spark.createDataFrame(university_dfpd, schema_university)

#####################################################################################################
#3.COMPANY
company_dfpd = pd.read_excel(r'Table_Source\Company_Table.xlsx')
schema_company = StructType([\
                     StructField("Company",StringType(),False),\
                     StructField("Total_Employes",IntegerType(),False),\
                     StructField("Total_Products",IntegerType(),False),\
                     StructField("Hike_Per_Anum",IntegerType(),False),\
                     StructField("WHF_Office",StringType(),False)])
company_dfps = spark.createDataFrame(company_dfpd, schema_company)
#####################################################################################################

# 3.PySpark DataFrame to TempView + Columns datatype

In [81]:
#A. Create pyspark dataframe into Temporary view for applying SQL scripts
student_dfps.createOrReplaceTempView("Student_Table")
university_dfps.createOrReplaceTempView("University_Table")
company_dfps.createOrReplaceTempView("Company_Table")

##### 1. Student_Table

In [74]:
#print student table schema
print("Student_Table Schema:")
student_dfps.printSchema()

#print total count of records 
print("Total records of Student_Table = ",student_dfps.count(),"\n\nStudent_Table Data:")

#List all the records in table
sql_query = "SELECT * FROM Student_Table"
spark.sql(sql_query).show(30)

Student_Table Schema:
root
 |-- ID: integer (nullable = false)
 |-- Name: string (nullable = false)
 |-- Gender: string (nullable = false)
 |-- DOB: date (nullable = false)
 |-- Location: string (nullable = true)
 |-- University: string (nullable = false)
 |-- Salary: double (nullable = false)
 |-- Company: string (nullable = false)
 |-- Email: string (nullable = false)

Total records of Student_Table =  24

Student_Table Data:
+---+----+------+----------+--------+----------+-------+---------+---------------+
| ID|Name|Gender|       DOB|Location|University| Salary|  Company|          Email|
+---+----+------+----------+--------+----------+-------+---------+---------------+
|101| AAA|     M|1994-10-10|Banglore|      IISC|55000.5|Microsoft|  AAA@gmail.com|
|102| BBB|     F|1995-09-20|     HYD|      IIIT|76000.2|   Amazon|BBB@hotmail.com|
|103| CCC|     M|1992-12-31| Chennai|       NIT|49200.5|   Google|  CCC@gmail.com|
|104| DDD|     F|1990-11-22|  Mumbai|       VIT|54980.6|    Apple|DDD@hotmail.com|
|105| EEE|     M|1993-05-19| Chennai|       IIT|60200.7|Microsoft|  EEE@gmail.com|
|106| FFF|     M|1994-07-23|     HYD|      IIIT|63100.8|Microsoft|  FFF@gmail.com|
|107| GGG|     F|1994-10-10|  Mumbai|       VIT|60200.7|   Amazon|GGG@hotmail.com|
|108| HHH|     M|1990-10-10|Banglore|       NIT|89200.7|    Apple|  HHH@gmail.com|
|109| III|     F|1994-12-21|     HYD|      IIIT|66980.8|   Google|  III@gmail.com|
|110| JJJ|     M|1990-11-22| Chennai|       NIT|59250.2|   Amazon|JJJ@hotmail.com|
|111| KKK|     M|1994-10-10|Banglore|      IISC|76300.9|Microsoft|  KKK@gmail.com|
|112| LLL|     F|1995-09-20|  Mumbai|       NIT|67900.8|    Apple|  LLL@gmail.com|
|113| MMM|     F|1994-10-15|     NaN|       VIT|60200.7|   Google|MMM@hotmail.com|
|114| NNN|     F|1990-11-29|Banglore|      IIIT|59200.5|   Amazon|  NNN@gmail.com|
|115| OOO|     M|1995-09-20|Banglore|      IISC|57120.5|   Google|  OOO@gmail.com|
|116| PPP|     F|1994-10-28| Chennai|       IIT|59050.5|    Apple|  PPP@gmail.com|
|117| QQQ|     M|1991-02-10|Banglore|      IISC|60200.7|Microsoft|QQQ@hotmail.com|
|118| RRR|     F|1993-11-10|  Mumbai|       NIT|52900.5|   Google|  RRR@gmail.com|
|119| SSS|     M|1992-10-25|     NaN|       VIT|62900.5|Microsoft|  SSS@gmail.com|
|120| TTT|     M|1995-09-29| Chennai|      IIIT|57230.5|    Apple|TTT@hotmail.com|
|121| UUU|     F|1990-11-13| Chennai|       NIT|59250.2|   Google|  UUU@gmail.com|
|122| VVV|     M|1993-08-19|Banglore|      IISC|57120.5|Microsoft|  VVV@gmail.com|
|123| WWW|     F|1994-09-14|  Mumbai|       VIT|59050.5|    Apple|WWW@hotmail.com|
|124| XXX|     M|1991-12-19|     HYD|       IIT|60200.7|Microsoft|  XXX@gmail.com|
+---+----+------+----------+--------+----------+-------+---------+---------------+

##### 2. University_Table

In [75]:
#print university table schema
print("University_Table Schema:")
university_dfps.printSchema()

#print total count of records 
print("Total records of University_Table = ",university_dfps.count(),"\n\nUniversity_Table Data:")

#List all the records in table
sql_query = "SELECT * FROM University_Table"
spark.sql(sql_query).show(30)

University_Table Schema:
root
 |-- University: string (nullable = false)
 |-- MinSalary: string (nullable = false)
 |-- PlayGround: string (nullable = false)
 |-- Total_Students: integer (nullable = false)

Total records of University_Table =  7

University_Table Data:
+----------+---------+----------+--------------+
|University|MinSalary|PlayGround|Total_Students|
+----------+---------+----------+--------------+
|      IISC|      35K|       YES|           250|
|      IIIT|      37K|       YES|           300|
|       NIT|      33K|        NO|           280|
|       VIT|      36K|        NO|           220|
|       MIT|      32K|       YES|           230|
|       IIT|      38K|       YES|           240|
|      JNTU|      33K|        NO|           250|
+----------+---------+----------+--------------+

##### 3. Company_Table

In [76]:
#print company table schema
print("Company_Table Schema:")
company_dfps.printSchema()

#print total count of records 
print("Total records of Company_Table = ",company_dfps.count(),"\n\nCompany_Table Data:")

#List all the records in table
sql_query = "SELECT * FROM Company_Table"
spark.sql(sql_query).show(30)

Company_Table Schema:
root
 |-- Company: string (nullable = false)
 |-- Total_Employes: integer (nullable = false)
 |-- Total_Products: integer (nullable = false)
 |-- Hike_Per_Anum: integer (nullable = false)
 |-- WHF_Office: string (nullable = false)

Total records of Company_Table =  6

Company_Table Data:
+---------+--------------+--------------+-------------+----------+
|  Company|Total_Employes|Total_Products|Hike_Per_Anum|WHF_Office|
+---------+--------------+--------------+-------------+----------+
|Microsoft|         25000|            50|           25|       WFH|
|      TCS|        450000|            20|           20|    Office|
|  Infosys|        350000|            19|           18|    Office|
|   Google|         30000|            55|           25|       WFH|
|   Amazon|        150000|            25|           22|    Office|
|    Apple|        200000|            30|           21|       WFH|
+---------+--------------+--------------+-------------+----------+

# ðŸ˜Ž

# 4.SQL Practice starts here

# @##############################################################@

# 4A.Select statement + Alias names + Limit + Count(*)

##### SELECT

In [9]:
#Select statement used to select(Print) data 
#We can give perticular column names to print, or use * to print all columns
# Table name = Student_Table
#show(5) for limiting records tobe printed

print("4A1). Print only ID, NAME, GENDER columns")
sql_query="""SELECT ID, NAME, GENDER FROM Student_Table"""
spark.sql(sql_query).show(5)

4A1). Print only ID, NAME, GENDER columns
+---+----+------+
| ID|NAME|GENDER|
+---+----+------+
|101| AAA|     M|
|102| BBB|     F|
|103| CCC|     M|
|104| DDD|     F|
|105| EEE|     M|
+---+----+------+
only showing top 5 rows

##### SELECT *

In [10]:
#use * for printing all columns data to console, ##show(5) for limiting records tobe printed
print("4A2). Print all columns from table")

sql_query="""SELECT * FROM Student_Table"""
spark.sql(sql_query).show(5)

4A2). Print all columns from table
+---+----+------+----------+--------+----------+-------+---------+---------------+
| ID|Name|Gender|       DOB|Location|University| Salary|  Company|          Email|
+---+----+------+----------+--------+----------+-------+---------+---------------+
|101| AAA|     M|1994-10-10|Banglore|      IISC|55000.5|Microsoft|  AAA@gmail.com|
|102| BBB|     F|1995-09-20|     HYD|      IIIT|76000.2|   Amazon|BBB@hotmail.com|
|103| CCC|     M|1992-12-31| Chennai|       NIT|49200.5|   Google|  CCC@gmail.com|
|104| DDD|     F|1990-11-22|  Mumbai|       VIT|54980.6|    Apple|DDD@hotmail.com|
|105| EEE|     M|1993-05-19| Chennai|       IIT|60200.7|Microsoft|  EEE@gmail.com|
+---+----+------+----------+--------+----------+-------+---------+---------------+
only showing top 5 rows

##### Alias names for columns

In [11]:
#Renaming columns with more meaningful names
print("4A3). Alias name for ID, Name columns")

sql_query="""SELECT ID as ID_Number, Name as Name_of_Student FROM Student_Table"""
spark.sql(sql_query).show(5)

4A3). Alias name for ID, Name columns
+---------+---------------+
|ID_Number|Name_of_Student|
+---------+---------------+
|      101|            AAA|
|      102|            BBB|
|      103|            CCC|
|      104|            DDD|
|      105|            EEE|
+---------+---------------+
only showing top 5 rows

##### LIMIT

In [12]:
#Limiting number of records with LIMIT
print("4A4). Limiting number of records tobe printing on console with Limit by 4")

sql_query="""SELECT * FROM Student_Table LIMIT 4"""
spark.sql(sql_query).show()

4A4). Limiting number of records tobe printing on console with Limit by 4
+---+----+------+----------+--------+----------+-------+---------+---------------+
| ID|Name|Gender|       DOB|Location|University| Salary|  Company|          Email|
+---+----+------+----------+--------+----------+-------+---------+---------------+
|101| AAA|     M|1994-10-10|Banglore|      IISC|55000.5|Microsoft|  AAA@gmail.com|
|102| BBB|     F|1995-09-20|     HYD|      IIIT|76000.2|   Amazon|BBB@hotmail.com|
|103| CCC|     M|1992-12-31| Chennai|       NIT|49200.5|   Google|  CCC@gmail.com|
|104| DDD|     F|1990-11-22|  Mumbai|       VIT|54980.6|    Apple|DDD@hotmail.com|
+---+----+------+----------+--------+----------+-------+---------+---------------+

##### Count(*)

In [13]:
#Count(*) function used to return total number of records that are matching given criteria
    #if no filter given for count(*), it will print total records in given table

print("4A5). Print total records in given table")

sql_query="""SELECT count(*)as Total_Count FROM Student_Table"""
spark.sql(sql_query).show()

4A5). Print total records in given table
+-----------+
|Total_Count|
+-----------+
|         24|
+-----------+

##### Select random text

In [14]:
#Selectng some random text using select statement
print("4A6). Print some sample text using select statement")

sql_query="""SELECT 'Hello I am SQL' as Column_Name """
spark.sql(sql_query).show()

4A6). Print some sample text using select statement
+--------------+
|   Column_Name|
+--------------+
|Hello I am SQL|
+--------------+

## 4B.Distinct statement

In [15]:
#Distinct statement used for listing only distinct(different) values in column or list of columns

print("4B1). Without Distinct statement, it will lsit all reocrds in that column(s)")
sql_query="SELECT Location FROM Student_Table"
spark.sql(sql_query).show(30)


print("4B2). With Distinct statement, it will lsit only distinct reocrds in that column(s)")
sql_query="SELECT distinct Location FROM Student_Table"
spark.sql(sql_query).show(30)

4B1). Without Distinct statement, it will lsit all reocrds in that column(s)
+--------+
|Location|
+--------+
|Banglore|
|     HYD|
| Chennai|
|  Mumbai|
| Chennai|
|     HYD|
|  Mumbai|
|Banglore|
|     HYD|
| Chennai|
|Banglore|
|  Mumbai|
|     NaN|
|Banglore|
|Banglore|
| Chennai|
|Banglore|
|  Mumbai|
|     NaN|
| Chennai|
| Chennai|
|Banglore|
|  Mumbai|
|     HYD|
+--------+

4B2). With Distinct statement, it will lsit only distinct reocrds in that column(s)
+--------+
|Location|
+--------+
| Chennai|
|  Mumbai|
|     NaN|
|     HYD|
|Banglore|
+--------+

## 4C.WHERE clause + BETWEEN + LIKE + IN + AND + OR + IS NULL

##### WHERE

In [16]:
#Where clause used to filter reocrds based on given condition on columns
#Below query will filter records from location Banglore

print("4C1). Print records only from Banglore location")
sql_query="SELECT * FROM Student_Table WHERE Location = 'Banglore'"
spark.sql(sql_query).show(30)

4C1). Print records only from Banglore location
+---+----+------+----------+--------+----------+-------+---------+---------------+
| ID|Name|Gender|       DOB|Location|University| Salary|  Company|          Email|
+---+----+------+----------+--------+----------+-------+---------+---------------+
|101| AAA|     M|1994-10-10|Banglore|      IISC|55000.5|Microsoft|  AAA@gmail.com|
|108| HHH|     M|1990-10-10|Banglore|       NIT|89200.7|    Apple|  HHH@gmail.com|
|111| KKK|     M|1994-10-10|Banglore|      IISC|76300.9|Microsoft|  KKK@gmail.com|
|114| NNN|     F|1990-11-29|Banglore|      IIIT|59200.5|   Amazon|  NNN@gmail.com|
|115| OOO|     M|1995-09-20|Banglore|      IISC|57120.5|   Google|  OOO@gmail.com|
|117| QQQ|     M|1991-02-10|Banglore|      IISC|60200.7|Microsoft|QQQ@hotmail.com|
|122| VVV|     M|1993-08-19|Banglore|      IISC|57120.5|Microsoft|  VVV@gmail.com|
+---+----+------+----------+--------+----------+-------+---------+---------------+

##### WHERE + BETWEEN

In [17]:
print("4C2). Print records only ID range from 105 to 109 Inclusive")

sql_query="""SELECT * FROM Student_Table WHERE ID BETWEEN 105 AND 109"""
spark.sql(sql_query).show(30)

4C2). Print records only ID range from 105 to 109 Inclusive
+---+----+------+----------+--------+----------+-------+---------+---------------+
| ID|Name|Gender|       DOB|Location|University| Salary|  Company|          Email|
+---+----+------+----------+--------+----------+-------+---------+---------------+
|105| EEE|     M|1993-05-19| Chennai|       IIT|60200.7|Microsoft|  EEE@gmail.com|
|106| FFF|     M|1994-07-23|     HYD|      IIIT|63100.8|Microsoft|  FFF@gmail.com|
|107| GGG|     F|1994-10-10|  Mumbai|       VIT|60200.7|   Amazon|GGG@hotmail.com|
|108| HHH|     M|1990-10-10|Banglore|       NIT|89200.7|    Apple|  HHH@gmail.com|
|109| III|     F|1994-12-21|     HYD|      IIIT|66980.8|   Google|  III@gmail.com|
+---+----+------+----------+--------+----------+-------+---------+---------------+

##### WHERE + LIKE

In [18]:
print("4C3). Print records only Company value contains soft")

sql_query="""SELECT * FROM Student_Table WHERE COMPANY LIKE "%soft%" """
spark.sql(sql_query).show(30)

4C3). Print records only Company value contains soft
+---+----+------+----------+--------+----------+-------+---------+---------------+
| ID|Name|Gender|       DOB|Location|University| Salary|  Company|          Email|
+---+----+------+----------+--------+----------+-------+---------+---------------+
|101| AAA|     M|1994-10-10|Banglore|      IISC|55000.5|Microsoft|  AAA@gmail.com|
|105| EEE|     M|1993-05-19| Chennai|       IIT|60200.7|Microsoft|  EEE@gmail.com|
|106| FFF|     M|1994-07-23|     HYD|      IIIT|63100.8|Microsoft|  FFF@gmail.com|
|111| KKK|     M|1994-10-10|Banglore|      IISC|76300.9|Microsoft|  KKK@gmail.com|
|117| QQQ|     M|1991-02-10|Banglore|      IISC|60200.7|Microsoft|QQQ@hotmail.com|
|119| SSS|     M|1992-10-25|     NaN|       VIT|62900.5|Microsoft|  SSS@gmail.com|
|122| VVV|     M|1993-08-19|Banglore|      IISC|57120.5|Microsoft|  VVV@gmail.com|
|124| XXX|     M|1991-12-19|     HYD|       IIT|60200.7|Microsoft|  XXX@gmail.com|
+---+----+------+----------+--------+----------+-------+---------+---------------+

##### WHERE + IN

In [19]:
print("4C4). Print records only Name in given list(AAA, GGG, KKK)")

sql_query="""SELECT * FROM Student_Table WHERE NAME IN ('AAA', 'GGG', 'KKK') """
spark.sql(sql_query).show(30)

4C4). Print records only Name in given list(AAA, GGG, KKK)
+---+----+------+----------+--------+----------+-------+---------+---------------+
| ID|Name|Gender|       DOB|Location|University| Salary|  Company|          Email|
+---+----+------+----------+--------+----------+-------+---------+---------------+
|101| AAA|     M|1994-10-10|Banglore|      IISC|55000.5|Microsoft|  AAA@gmail.com|
|107| GGG|     F|1994-10-10|  Mumbai|       VIT|60200.7|   Amazon|GGG@hotmail.com|
|111| KKK|     M|1994-10-10|Banglore|      IISC|76300.9|Microsoft|  KKK@gmail.com|
+---+----+------+----------+--------+----------+-------+---------+---------------+

##### WHERE + AND

In [20]:
#And should satisfy all conditions
print("4C5). Print records from Banglore location and Microsoft company")

sql_query="""SELECT * FROM Student_Table WHERE (LOCATION ='Banglore' AND COMPANY ='Microsoft') """
spark.sql(sql_query).show(30)

4C5). Print records from Banglore location and Microsoft company
+---+----+------+----------+--------+----------+-------+---------+---------------+
| ID|Name|Gender|       DOB|Location|University| Salary|  Company|          Email|
+---+----+------+----------+--------+----------+-------+---------+---------------+
|101| AAA|     M|1994-10-10|Banglore|      IISC|55000.5|Microsoft|  AAA@gmail.com|
|111| KKK|     M|1994-10-10|Banglore|      IISC|76300.9|Microsoft|  KKK@gmail.com|
|117| QQQ|     M|1991-02-10|Banglore|      IISC|60200.7|Microsoft|QQQ@hotmail.com|
|122| VVV|     M|1993-08-19|Banglore|      IISC|57120.5|Microsoft|  VVV@gmail.com|
+---+----+------+----------+--------+----------+-------+---------+---------------+

##### WHERE + OR

In [21]:
#OR should satisfy any one conditions, Either of the condition will meet the output
print("4C6). Print records from Banglore location or Microsoft company")

sql_query="""SELECT * FROM Student_Table WHERE (LOCATION ='Banglore' OR COMPANY ='Microsoft') """
spark.sql(sql_query).show(30)

4C6). Print records from Banglore location or Microsoft company
+---+----+------+----------+--------+----------+-------+---------+---------------+
| ID|Name|Gender|       DOB|Location|University| Salary|  Company|          Email|
+---+----+------+----------+--------+----------+-------+---------+---------------+
|101| AAA|     M|1994-10-10|Banglore|      IISC|55000.5|Microsoft|  AAA@gmail.com|
|105| EEE|     M|1993-05-19| Chennai|       IIT|60200.7|Microsoft|  EEE@gmail.com|
|106| FFF|     M|1994-07-23|     HYD|      IIIT|63100.8|Microsoft|  FFF@gmail.com|
|108| HHH|     M|1990-10-10|Banglore|       NIT|89200.7|    Apple|  HHH@gmail.com|
|111| KKK|     M|1994-10-10|Banglore|      IISC|76300.9|Microsoft|  KKK@gmail.com|
|114| NNN|     F|1990-11-29|Banglore|      IIIT|59200.5|   Amazon|  NNN@gmail.com|
|115| OOO|     M|1995-09-20|Banglore|      IISC|57120.5|   Google|  OOO@gmail.com|
|117| QQQ|     M|1991-02-10|Banglore|      IISC|60200.7|Microsoft|QQQ@hotmail.com|
|119| SSS|     M|1992-10-25|     NaN|       VIT|62900.5|Microsoft|  SSS@gmail.com|
|122| VVV|     M|1993-08-19|Banglore|      IISC|57120.5|Microsoft|  VVV@gmail.com|
|124| XXX|     M|1991-12-19|     HYD|       IIT|60200.7|Microsoft|  XXX@gmail.com|
+---+----+------+----------+--------+----------+-------+---------+---------------+

##### WHERE + IS NULL + IS NOT NULL

In [22]:
#Is Null will filter given column having Null values, #Is Not Null will print having proper value
# Null is nothing but, missing value in any column(Except Primay key column), it will represent with some meaningful value

print("4C7). Print records where University is not null, Here all records will be printed because all rows are having Proper values in University column")

sql_query="""SELECT * FROM Student_Table WHERE University IS NOT NULL"""
spark.sql(sql_query).show(30)

4C7). Print records where University is not null, Here all records will be printed because all rows are having Proper values in University column
+---+----+------+----------+--------+----------+-------+---------+---------------+
| ID|Name|Gender|       DOB|Location|University| Salary|  Company|          Email|
+---+----+------+----------+--------+----------+-------+---------+---------------+
|101| AAA|     M|1994-10-10|Banglore|      IISC|55000.5|Microsoft|  AAA@gmail.com|
|102| BBB|     F|1995-09-20|     HYD|      IIIT|76000.2|   Amazon|BBB@hotmail.com|
|103| CCC|     M|1992-12-31| Chennai|       NIT|49200.5|   Google|  CCC@gmail.com|
|104| DDD|     F|1990-11-22|  Mumbai|       VIT|54980.6|    Apple|DDD@hotmail.com|
|105| EEE|     M|1993-05-19| Chennai|       IIT|60200.7|Microsoft|  EEE@gmail.com|
|106| FFF|     M|1994-07-23|     HYD|      IIIT|63100.8|Microsoft|  FFF@gmail.com|
|107| GGG|     F|1994-10-10|  Mumbai|       VIT|60200.7|   Amazon|GGG@hotmail.com|
|108| HHH|     M|1990-10-10|Banglore|       NIT|89200.7|    Apple|  HHH@gmail.com|
|109| III|     F|1994-12-21|     HYD|      IIIT|66980.8|   Google|  III@gmail.com|
|110| JJJ|     M|1990-11-22| Chennai|       NIT|59250.2|   Amazon|JJJ@hotmail.com|
|111| KKK|     M|1994-10-10|Banglore|      IISC|76300.9|Microsoft|  KKK@gmail.com|
|112| LLL|     F|1995-09-20|  Mumbai|       NIT|67900.8|    Apple|  LLL@gmail.com|
|113| MMM|     F|1994-10-15|     NaN|       VIT|60200.7|   Google|MMM@hotmail.com|
|114| NNN|     F|1990-11-29|Banglore|      IIIT|59200.5|   Amazon|  NNN@gmail.com|
|115| OOO|     M|1995-09-20|Banglore|      IISC|57120.5|   Google|  OOO@gmail.com|
|116| PPP|     F|1994-10-28| Chennai|       IIT|59050.5|    Apple|  PPP@gmail.com|
|117| QQQ|     M|1991-02-10|Banglore|      IISC|60200.7|Microsoft|QQQ@hotmail.com|
|118| RRR|     F|1993-11-10|  Mumbai|       NIT|52900.5|   Google|  RRR@gmail.com|
|119| SSS|     M|1992-10-25|     NaN|       VIT|62900.5|Microsoft|  SSS@gmail.com|
|120| TTT|     M|1995-09-29| Chennai|      IIIT|57230.5|    Apple|TTT@hotmail.com|
|121| UUU|     F|1990-11-13| Chennai|       NIT|59250.2|   Google|  UUU@gmail.com|
|122| VVV|     M|1993-08-19|Banglore|      IISC|57120.5|Microsoft|  VVV@gmail.com|
|123| WWW|     F|1994-09-14|  Mumbai|       VIT|59050.5|    Apple|WWW@hotmail.com|
|124| XXX|     M|1991-12-19|     HYD|       IIT|60200.7|Microsoft|  XXX@gmail.com|
+---+----+------+----------+--------+----------+-------+---------+---------------+

# 4D.Order By

##### ORDER BY ASE

In [23]:
#Bydefault it is Accending order, for descending order we have to use DESC keyword
    #Number: 0 to n bydefault, DESC: n to 0
    #Alphabets: A to Z bydefault, DESC: Z to A
    
print("4D1). Sort by Salary Accending order top 5 records")

sql_query="""SELECT * FROM Student_Table ORDER BY Salary LIMIT 5"""
spark.sql(sql_query).show()

4D1). Sort by Salary Accending order top 5 records
+---+----+------+----------+--------+----------+-------+---------+---------------+
| ID|Name|Gender|       DOB|Location|University| Salary|  Company|          Email|
+---+----+------+----------+--------+----------+-------+---------+---------------+
|103| CCC|     M|1992-12-31| Chennai|       NIT|49200.5|   Google|  CCC@gmail.com|
|118| RRR|     F|1993-11-10|  Mumbai|       NIT|52900.5|   Google|  RRR@gmail.com|
|104| DDD|     F|1990-11-22|  Mumbai|       VIT|54980.6|    Apple|DDD@hotmail.com|
|101| AAA|     M|1994-10-10|Banglore|      IISC|55000.5|Microsoft|  AAA@gmail.com|
|115| OOO|     M|1995-09-20|Banglore|      IISC|57120.5|   Google|  OOO@gmail.com|
+---+----+------+----------+--------+----------+-------+---------+---------------+

##### ORDER BY DESC

In [24]:
print("4D2). Sort by Name Descending order top 5 records")

sql_query="""SELECT * FROM Student_Table ORDER BY Name DESC LIMIT 5"""
spark.sql(sql_query).show()

4D2). Sort by Name Descending order top 5 records
+---+----+------+----------+--------+----------+-------+---------+---------------+
| ID|Name|Gender|       DOB|Location|University| Salary|  Company|          Email|
+---+----+------+----------+--------+----------+-------+---------+---------------+
|124| XXX|     M|1991-12-19|     HYD|       IIT|60200.7|Microsoft|  XXX@gmail.com|
|123| WWW|     F|1994-09-14|  Mumbai|       VIT|59050.5|    Apple|WWW@hotmail.com|
|122| VVV|     M|1993-08-19|Banglore|      IISC|57120.5|Microsoft|  VVV@gmail.com|
|121| UUU|     F|1990-11-13| Chennai|       NIT|59250.2|   Google|  UUU@gmail.com|
|120| TTT|     M|1995-09-29| Chennai|      IIIT|57230.5|    Apple|TTT@hotmail.com|
+---+----+------+----------+--------+----------+-------+---------+---------------+

# 4E. Upper() + Lower() + Length()

In [25]:
#Upper()-->Convert given column data into upper case data
#Lower()-->Convert given column data into lower case data
#Length()-->It will print total characters in columns data including spaces

print("4E1). Apply Upper(), Lower(), Length() functions to columns")

sql_query="""SELECT DISTINCT COMPANY,UPPER(COMPANY), LOWER(COMPANY), LENGTH(COMPANY) FROM Student_Table"""
spark.sql(sql_query).show()

4E1). Apply Upper(), Lower(), Length() functions to columns
+---------+--------------+--------------+---------------+
|  COMPANY|upper(COMPANY)|lower(COMPANY)|length(COMPANY)|
+---------+--------------+--------------+---------------+
|Microsoft|     MICROSOFT|     microsoft|              9|
|    Apple|         APPLE|         apple|              5|
|   Amazon|        AMAZON|        amazon|              6|
|   Google|        GOOGLE|        google|              6|
+---------+--------------+--------------+---------------+

# 4F. Concatination(||) + BooleanExpression + TRIM()

##### Concatination

In [26]:
#Concatination using ||
    #This will help to club mutiple columns and some text into single column

print("4F1). Concatination using || symbol")

sql_query="""SELECT 'I am ' || Name || ' from ' || University as SelfIntro FROM Student_Table LIMIT 10"""
spark.sql(sql_query).show()

4F1). Concatination using || symbol
+------------------+
|         SelfIntro|
+------------------+
|I am AAA from IISC|
|I am BBB from IIIT|
| I am CCC from NIT|
| I am DDD from VIT|
| I am EEE from IIT|
|I am FFF from IIIT|
| I am GGG from VIT|
| I am HHH from NIT|
|I am III from IIIT|
| I am JJJ from NIT|
+------------------+

##### Boolean Expression

In [27]:
#Boolean Expression with some condition:
    #THis will print True or False values 

print("4F2). Boolean Expression with some condition")

sql_query="""SELECT ID, NAME, SALARY, (Salary > 60000) As IsSalaryGraterThan60K FROM Student_Table LIMIT 10"""
spark.sql(sql_query).show()

4F2). Boolean Expression with some condition
+---+----+-------+---------------------+
| ID|NAME| SALARY|IsSalaryGraterThan60K|
+---+----+-------+---------------------+
|101| AAA|55000.5|                false|
|102| BBB|76000.2|                 true|
|103| CCC|49200.5|                false|
|104| DDD|54980.6|                false|
|105| EEE|60200.7|                 true|
|106| FFF|63100.8|                 true|
|107| GGG|60200.7|                 true|
|108| HHH|89200.7|                 true|
|109| III|66980.8|                 true|
|110| JJJ|59250.2|                false|
+---+----+-------+---------------------+

##### TRIM

In [28]:
#Trim() function used to remove extra spaces in column's data

print("4F3). Trim() function used to remove extra spaces in column's data")

sql_query="""SELECT 
'   Google    ' AS ExtraSpaces, LENGTH('   Google    ') AS Len_ExtraSpaces,
TRIM('   Google    ') AS TrimApplied, LENGTH(TRIM('   Google    ')) AS Len_TrimApplied
"""
spark.sql(sql_query).show()

4F3). Trim() function used to remove extra spaces in column's data
+-------------+---------------+-----------+---------------+
|  ExtraSpaces|Len_ExtraSpaces|TrimApplied|Len_TrimApplied|
+-------------+---------------+-----------+---------------+
|   Google    |             13|     Google|              6|
+-------------+---------------+-----------+---------------+

# 4G.SUBSTRING() + REPLACE() + POSITION()

##### SUBSTRING

In [29]:
#SUBSTRING() --> function extracts given range text from column 

print("4G1).Extract IIIT from IIIT Banglore")

sql_query="""SELECT 'IIIT Banglore' AS FullColumn, SUBSTRING('IIIT Banglore',1,4) AS SubstringColumn """
spark.sql(sql_query).show()

4G1).Extract IIIT from IIIT Banglore
+-------------+---------------+
|   FullColumn|SubstringColumn|
+-------------+---------------+
|IIIT Banglore|           IIIT|
+-------------+---------------+

##### REPLACE

In [31]:
#REPLACE() --> function will replace given text with given replaced value

print("4G2). Replace all IIIT to IIIT-B")

sql_query="""SELECT ID, Name, University, REPLACE(UNIVERSITY, 'IIIT', 'IIIT-B')AS Replaced FROM Student_Table LIMIT 10"""
spark.sql(sql_query).show()

4G2). Replace all IIIT to IIIT-B
+---+----+----------+--------+
| ID|Name|University|Replaced|
+---+----+----------+--------+
|101| AAA|      IISC|    IISC|
|102| BBB|      IIIT|  IIIT-B|
|103| CCC|       NIT|     NIT|
|104| DDD|       VIT|     VIT|
|105| EEE|       IIT|     IIT|
|106| FFF|      IIIT|  IIIT-B|
|107| GGG|       VIT|     VIT|
|108| HHH|       NIT|     NIT|
|109| III|      IIIT|  IIIT-B|
|110| JJJ|       NIT|     NIT|
+---+----+----------+--------+

##### POSITION

In [34]:
#POSITION() --> Will print the position number of given pattern or character or string

print("4G3).Print @ symbol position in Email column")

sql_query="""SELECT ID, Name, Email, POSITION('@' IN Email) AS PositionColumn FROM Student_Table LIMIT 10"""
spark.sql(sql_query).show()

4G3).Print @ symbol position in Email column
+---+----+---------------+--------------+
| ID|Name|          Email|PositionColumn|
+---+----+---------------+--------------+
|101| AAA|  AAA@gmail.com|             4|
|102| BBB|BBB@hotmail.com|             4|
|103| CCC|  CCC@gmail.com|             4|
|104| DDD|DDD@hotmail.com|             4|
|105| EEE|  EEE@gmail.com|             4|
|106| FFF|  FFF@gmail.com|             4|
|107| GGG|GGG@hotmail.com|             4|
|108| HHH|  HHH@gmail.com|             4|
|109| III|  III@gmail.com|             4|
|110| JJJ|JJJ@hotmail.com|             4|
+---+----+---------------+--------------+

# 4H. Aggregation Functions:

##### MAX()

In [41]:
#Sort table based on DOB Descending order

print("4H1-a).Print Table Based on Salary Descending order ")
sql_query="""SELECT * FROM Student_Table ORDER BY Salary DESC LIMIT 10"""
spark.sql(sql_query).show()


print("4H1-b).Print Maximum value in Salary")
sql_query="""SELECT MAX(Salary) AS MAX_Salary FROM Student_Table"""
spark.sql(sql_query).show()

4H1-a).Print Table Based on Salary Descending order
+---+----+------+----------+--------+----------+-------+---------+---------------+
| ID|Name|Gender|       DOB|Location|University| Salary|  Company|          Email|
+---+----+------+----------+--------+----------+-------+---------+---------------+
|108| HHH|     M|1990-10-10|Banglore|       NIT|89200.7|    Apple|  HHH@gmail.com|
|111| KKK|     M|1994-10-10|Banglore|      IISC|76300.9|Microsoft|  KKK@gmail.com|
|102| BBB|     F|1995-09-20|     HYD|      IIIT|76000.2|   Amazon|BBB@hotmail.com|
|112| LLL|     F|1995-09-20|  Mumbai|       NIT|67900.8|    Apple|  LLL@gmail.com|
|109| III|     F|1994-12-21|     HYD|      IIIT|66980.8|   Google|  III@gmail.com|
|106| FFF|     M|1994-07-23|     HYD|      IIIT|63100.8|Microsoft|  FFF@gmail.com|
|119| SSS|     M|1992-10-25|     NaN|       VIT|62900.5|Microsoft|  SSS@gmail.com|
|117| QQQ|     M|1991-02-10|Banglore|      IISC|60200.7|Microsoft|QQQ@hotmail.com|
|113| MMM|     F|1994-10-15|     NaN|       VIT|60200.7|   Google|MMM@hotmail.com|
|107| GGG|     F|1994-10-10|  Mumbai|       VIT|60200.7|   Amazon|GGG@hotmail.com|
+---+----+------+----------+--------+----------+-------+---------+---------------+

4H1-b).Print Maximum value in Salary
+----------+
|MAX_Salary|
+----------+
|   89200.7|
+----------+

##### MIN()

In [43]:
#Sort table based on DOB Descending order

print("4H2-a).Print Table Based on Salary Assending order ")
sql_query="""SELECT * FROM Student_Table ORDER BY Salary LIMIT 10"""
spark.sql(sql_query).show()


print("4H2-b).Print Minimum value in Salary")
sql_query="""SELECT MIN(Salary) AS MIN_Salary FROM Student_Table"""
spark.sql(sql_query).show()

4H1-a).Print Table Based on Salary Assending order
+---+----+------+----------+--------+----------+-------+---------+---------------+
| ID|Name|Gender|       DOB|Location|University| Salary|  Company|          Email|
+---+----+------+----------+--------+----------+-------+---------+---------------+
|103| CCC|     M|1992-12-31| Chennai|       NIT|49200.5|   Google|  CCC@gmail.com|
|118| RRR|     F|1993-11-10|  Mumbai|       NIT|52900.5|   Google|  RRR@gmail.com|
|104| DDD|     F|1990-11-22|  Mumbai|       VIT|54980.6|    Apple|DDD@hotmail.com|
|101| AAA|     M|1994-10-10|Banglore|      IISC|55000.5|Microsoft|  AAA@gmail.com|
|115| OOO|     M|1995-09-20|Banglore|      IISC|57120.5|   Google|  OOO@gmail.com|
|122| VVV|     M|1993-08-19|Banglore|      IISC|57120.5|Microsoft|  VVV@gmail.com|
|120| TTT|     M|1995-09-29| Chennai|      IIIT|57230.5|    Apple|TTT@hotmail.com|
|116| PPP|     F|1994-10-28| Chennai|       IIT|59050.5|    Apple|  PPP@gmail.com|
|123| WWW|     F|1994-09-14|  Mumbai|       VIT|59050.5|    Apple|WWW@hotmail.com|
|114| NNN|     F|1990-11-29|Banglore|      IIIT|59200.5|   Amazon|  NNN@gmail.com|
+---+----+------+----------+--------+----------+-------+---------+---------------+

4H1-b).Print Minimum value in Salary
+----------+
|MIN_Salary|
+----------+
|   49200.5|
+----------+

##### AVG() + SUM()

In [44]:
#AVG() for average, SUM() for sum values based on given condition on column
print("4H3).AVG(), SUM() functions")
sql_query="""SELECT AVG(Salary) AS AverageSalary, SUM(Salary) AS SumSalary FROM Student_Table"""
spark.sql(sql_query).show()

4H3).AVG(), SUM() functions
+-----------------+------------------+
|    AverageSalary|         SumSalary|
+-----------------+------------------+
|61780.98750000001|1482743.7000000002|
+-----------------+------------------+

# 4I. GROUP BY + HAVING

##### GROUP BY

In [49]:
#GROUP BY is used to group THE ROWS BASED ON SOME VALUE IN COLUMN 
    #GROUP BY mainly used in Aggregating functions.

print("4I1).Print number of Students working in each company ")
sql_query="""SELECT Company, count(*) TotalStudentsPerCompany FROM Student_Table GROUP BY Company"""
spark.sql(sql_query).show(30)

4I1).Print number of Students working in each company
+---------+-----------------------+
|  Company|TotalStudentsPerCompany|
+---------+-----------------------+
|   Google|                      6|
|Microsoft|                      8|
|    Apple|                      6|
|   Amazon|                      4|
+---------+-----------------------+

In [53]:
print("4I2).Print Total salary of Students based on company. Note:Round function used")
sql_query="""SELECT Company, ROUND(SUM(Salary)) TotalStudentsPerCompany FROM Student_Table GROUP BY Company"""
spark.sql(sql_query).show(30)

4I2).Print Total salary of Students based on company. Note:Round function used
+---------+-----------------------+
|  Company|TotalStudentsPerCompany|
+---------+-----------------------+
|   Google|               345653.0|
|Microsoft|               495025.0|
|    Apple|               387414.0|
|   Amazon|               254652.0|
+---------+-----------------------+

##### HAVING

In [57]:
#Having: Having cluase is used because where cluase cannot be used in Aggregated function. It acts like a filter
print("4I3).Print list of companies which recruites more than 5 students")

sql_query="""SELECT Company, COUNT(*) AS CompanyHaveMorethan5Stu 
FROM Student_Table 
GROUP BY Company 
HAVING CompanyHaveMorethan5Stu>5"""

spark.sql(sql_query).show(30)

4I3).Print list of companies which recruites more than 5 students
+---------+-----------------------+
|  Company|CompanyHaveMorethan5Stu|
+---------+-----------------------+
|   Google|                      6|
|Microsoft|                      8|
|    Apple|                      6|
+---------+-----------------------+

# 4J. Sub Queries

In [80]:
#SubQuery can be nested inside where cluase of another SELECT statement
#We can use the comparison operators, such as >, <, or =. 
#The comparison operator can also be a multiple-row operator, such as IN, ANY, or ALL.

print("4J1).Subquery example. Hint: Only IIT, IIIT, IISC having PlayGround")
sql_query="""SELECT * 
FROM Student_Table 
WHERE University IN(
                    SELECT University 
                    FROM University_Table 
                    WHERE PlayGround = 'YES')"""
spark.sql(sql_query).show(30)

4J1).Subquery example. Hint: Only IIT, IIIT, IISC having PlayGround
+---+----+------+----------+--------+----------+-------+---------+---------------+
| ID|Name|Gender|       DOB|Location|University| Salary|  Company|          Email|
+---+----+------+----------+--------+----------+-------+---------+---------------+
|105| EEE|     M|1993-05-19| Chennai|       IIT|60200.7|Microsoft|  EEE@gmail.com|
|116| PPP|     F|1994-10-28| Chennai|       IIT|59050.5|    Apple|  PPP@gmail.com|
|124| XXX|     M|1991-12-19|     HYD|       IIT|60200.7|Microsoft|  XXX@gmail.com|
|102| BBB|     F|1995-09-20|     HYD|      IIIT|76000.2|   Amazon|BBB@hotmail.com|
|106| FFF|     M|1994-07-23|     HYD|      IIIT|63100.8|Microsoft|  FFF@gmail.com|
|109| III|     F|1994-12-21|     HYD|      IIIT|66980.8|   Google|  III@gmail.com|
|114| NNN|     F|1990-11-29|Banglore|      IIIT|59200.5|   Amazon|  NNN@gmail.com|
|120| TTT|     M|1995-09-29| Chennai|      IIIT|57230.5|    Apple|TTT@hotmail.com|
|101| AAA|     M|1994-10-10|Banglore|      IISC|55000.5|Microsoft|  AAA@gmail.com|
|111| KKK|     M|1994-10-10|Banglore|      IISC|76300.9|Microsoft|  KKK@gmail.com|
|115| OOO|     M|1995-09-20|Banglore|      IISC|57120.5|   Google|  OOO@gmail.com|
|117| QQQ|     M|1991-02-10|Banglore|      IISC|60200.7|Microsoft|QQQ@hotmail.com|
|122| VVV|     M|1993-08-19|Banglore|      IISC|57120.5|Microsoft|  VVV@gmail.com|
+---+----+------+----------+--------+----------+-------+---------+---------------+

In [ ]:
#
print("4).")
sql_query="""SELECT * FROM Student_Table"""
spark.sql(sql_query).show(5)

# Ruff

In [38]:
#python dict
dict1 = {"Name": ["A","B","C","D","E","F","G","H","I"],\
         "Weight":[70,61,83,60,92,69,84,71,77],\
         "Address":["HYD","Banglore","Chennai","Mumbai","Banglore","Mumbai","Chennai","Banglore","HYD"],\
         "DOB":["15-01-1990", "19-01-1996", "28-02-1999", "13-06-1989", "15-11-2000", "10-12-1995", "25-11-1998", "15-09-1994", "15-01-1996"],\
         "Batch":[2016, 2017, 2018, 2016, 2016, 2017, 2016, 2018, 2017],\
         "Salary":[51000.00, 46500.50, 52000.00, 51000.00, 52000.00, 75000.60, 64000.50, 52000.00, 46500.50]         
        }

#create pandas df
dfpd = pd.DataFrame(dict1)
dfpd_dtype = {"Name":'str', "Weight":'int64', "Address":'str', "DOB":'datetime64', "Batch":'int64', "Salary":'float64' }
dfpd = dfpd.astype(dfpd_dtype)

In [39]:
#Schema for spark dataframe with Structtype, fields
schema = StructType([\
                     StructField("Name", StringType(), True),\
                     StructField("Weight", IntegerType(), True),\
                     StructField("Address", StringType(), True),\
                     StructField("DOB", DateType(), True),\
                     StructField("Batch", IntegerType(), True),\
                     StructField("Salary", DoubleType(), True)])

#create spark DF by passing pandas df with above schema
dfps = spark.createDataFrame(dfpd, schema)

In [40]:
dfps.show()

+----+------+--------+----------+-----+-------+
|Name|Weight| Address|       DOB|Batch| Salary|
+----+------+--------+----------+-----+-------+
|   A|    70|     HYD|1990-01-15| 2016|51000.0|
|   B|    61|Banglore|1996-01-19| 2017|46500.5|
|   C|    83| Chennai|1999-02-28| 2018|52000.0|
|   D|    60|  Mumbai|1989-06-13| 2016|51000.0|
|   E|    92|Banglore|2000-11-15| 2016|52000.0|
|   F|    69|  Mumbai|1995-10-12| 2017|75000.6|
|   G|    84| Chennai|1998-11-25| 2016|64000.5|
|   H|    71|Banglore|1994-09-15| 2018|52000.0|
|   I|    77|     HYD|1996-01-15| 2017|46500.5|
+----+------+--------+----------+-----+-------+